import random

l_s = []
l_e = []

for i in range(25):
    l_s.append(random.randint(20, 60))

print("Список чисел  :", [l_s])
# i = 1
for i in range((len(l_s)) - 1):
    if i == ((len(l_s)) -1):
        break
    if i == 0:
        continue
    if l_s[i-1] < l_s[i] > l_s[i+1]:
        l_e.append(l_s[i])
print("Кількість елементів більших за своїх сусідів :", len(l_e))
print("Елементи які більші за своїх сусідів  :", l_e)



# Дано перелік чисел. Визначте, скільки в цьому списку елементів, які більше двох своїх сусідів (ліворуч та праворуч),
# і виведіть кількість таких елементів. Останні елементи списку ніколи не враховуються, оскільки у них недостатньо сусідів.