import random

my_l = []
k = int(input("Введіть індекс символу :"  ))

for i in range(10):
    my_l.append(random.randint(1, 10))

my_l_k = my_l[k]
print("Сфортмований список :", my_l)

for i in range(k + 1, len(my_l)):
    my_l[i - 1] = my_l[i]
my_l[-1] = my_l_k

print("Змінений список :", my_l)
my_l.pop()
print("Змінений список з видаленим останнім елементом :", my_l)



# Дано список із чисел та індекс елемента у списку `k`. Видаліть зі списку елемент з індексом `k`,
# зрушивши вліво всі елементи, що стоять правіше елемента з індексом `k`.
#
#
#
# a). Програма отримує на вхід перелік, потім число `k`. Програма зсуває всі елементи,
# а потім видаляє останній елемент списку за допомогою методу `pop()` без параметрів.
#
# b). Програма повинна здійснювати зсув безпосередньо у списку, а не робити це під час виведення
# елементів. Також не можна використовувати додатковий перелік.
#
# c). Також не слід використовувати метод `pop(k)` із параметром.
#
# d). Використати оператор del НЕ МОЖНА!
