f_l = [1, 2, 3, 4, 5, 6, 7, 8]
s_l = [5, 6, 7, 8, 9, 10, 11]

print(" Кількість унікальних елементів що одночасно присутні в обох списках :", len(set(f_l) & set(s_l)))






# Дано два списки чисел. Порахуйте скільки (унікальних) чисел міститься одночасно як у першому списку, так і в другому.
#
#  Примітка: Це завдання на Пітоні можна вирішити в один рядок.
#
# (Завдання вирішується із застосуванням множин)