new_str = "A balloon meant to her some other arrival from the surface of the earth."

print("Tретій символ :", new_str[2])                                            # a
print("передостанній символ :", new_str[-2])                                    # b
print("перші п'ять символів :", new_str[ :5])                                   # c
print("весь рядок, крім двох останніх символів :", new_str[ :-2])               # d
print("усі символи з парними індексами :", new_str[ : :2])                      # e
print("усі символи з непарними індексами :", new_str[1: :2])                    # f
print("усі символи у зворотному порядку :", new_str[ : :-1])                    # g
print("усі символи рядка через один у зворотному порядку, ", new_str[::-2])     # h
print("Довжина рядка :", len(new_str))                                          # i



'''Дано рядок.

   a. виведіть третій символ цього рядка.
   b. виведіть передостанній символ цього рядка.
   c. виведіть перші п'ять символів цього рядка.
   d. виведіть весь рядок, крім двох останніх символів.
   e. виведіть усі символи з парними індексами 
  вважаючи, що індексація починається з 0, тому символи виводяться з першого).
  f. виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
   g. виведіть усі символи у зворотному порядку.
  h. виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
   i. виведіть довжину цього рядка.'''